=begin
У вас есть файл, со следующей структурой и содержащий не менее 10 строк: Имя, фамилия и возраст
Прим.
Иван Иванов 20
Петр Петров 21
Необходимо прочитать файл, затем запросив у пользователя ввод возраста, найти в результатах чтения файла, студента
чей возраст равен введенному числу и записать этого студента(тов) в другой файл с названием results.txt. После этого
перезапросить ввод. Программа завершается выводом на экран содержимого файла results.txt построчно, если все
студенты из первого файла были записаны во второй или если пользователь ввел с клавиатуры -1
=end

